In [1]:
import pandas as pd
url = 'https://github.com/laxmimerit/All-CSV-ML-DATA-Files-Download/raw/master/Data%20-%20Multiple%20Worksheets.xlsx'
df = pd.read_excel(url)
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

## Checking that how many sheets it have

In [2]:
df = pd.read_excel(url, sheet_name=None)
df

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

So it have 2 sheets in the excel, if we don't provide the sheet name then it is take first sheet by default

In [3]:
df = pd.read_excel(url, sheet_name='Data 1')
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [4]:
df = pd.read_excel(url, sheet_name='Data 2')
df

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

## Other ways to extract the sheets

In [5]:
df = pd.read_excel(url, sheet_name=None)

In [6]:
df.items()

dict_items([('Data 1',   First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F), ('Data 2',   First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F)])

In [7]:
df1 = df['Data 1']
df2 = df['Data 2']

In [8]:
df1

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [9]:
df2

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

## saving the excel data

In [10]:
df = pd.read_excel(url, sheet_name=None)

In [13]:
df1 = df['Data 1']
df1.to_excel('data/df1.xlsx', index = None)

## writing the multiple sheets

In [14]:
with pd.ExcelWriter('data/multiple_sheet.xlsx') as fp:
        df1.to_excel(fp, sheet_name ='data 1')
        df2.to_excel(fp, sheet_name ='data 2')